src/main/java/requestFiles/customerInfo_GetCustomerInfo2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:jfi="http://schemas.datacontract.org/2004/07/JFI.Core.Services.Contracts.Auth">
   <soapenv:Header>
      <CompanyId xmlns="http://jonasfitness.com/Core/">101</CompanyId><CallerContext xmlns="http://jonasfitness.com/Core/">Member</CallerContext></soapenv:Header>
   <soapenv:Body>
      <tem:GetCustomerInfo>
         <!--Optional:-->
         <!-- Customer Not On File --> 
         <tem:customerId>299999</tem:customerId>
         <!--Optional:-->
         <!--tem:customerInfo>General</tem:customerInfo-->
      </tem:GetCustomerInfo>
   </soapenv:Body>
</soapenv:Envelope>